{
  "date": "20170223",
  "publish": "false",
  "tags":["development", "tools"],
  "header":{
    "title":"Never knowingly under mechanised",
    "subheader": "A philosophy for an easier life",
    "teaser":"This is the space for click bait"
  },
  "body":[
    "<p>For a number of years I built interactive exhibits for a small Science Museum. During this time, a pattern emerged: whatever we were building, I'd be looking for ways to improve and speed up the process. Whether it was a quicker way to prototype circuits, a better way to sand wood, or an optimisation in the way we machined plastics, I'd be thinking about it.<br></p><p>Fast forward to today, and I still hold true to this. Every project I work on I keep thinking how I can do this faster, or at least stop myself from spending this time again in future.&nbsp;<br></p><p>I have scripts for installing most of the tools that I've needed so far - certainly for those that needed more work than a simple apt-get. My gitconfig has been honed to a sharp collection of those commands that I just keep on using - and if it isn't in there, it's probably because I've not had to use that command that much (yet).</p><p>I even have a similar approach at home. Robots make my coffee and sweep my floors, all so I don't have to spend time on these repetitive tasks. &nbsp;</p><p>But there is always the question - is this really worth it? Does this actually save me any time or effort?</p><p>At this point, I turn to XKCD:</p><p><img src='https://imgs.xkcd.com/comics/automation.png' style='width: 404px;'></p><p>So far, the first graph is closer to my truth than the second. How? It's simple. Keep It Simple and Stupid. Don't try to automate perfectly. Accept that, however good, your coffee machine will need you to add beans, and that you will need to empty the dust bin on your Roomba. Some bits are just not worth the effort of trying to automate.</p><p>The same holds true for software; If you try to build the huge, perfect, complete system on day one, you are almost always doomed to failure; there are too many things to do, and you either overlook or don't release the quick wins - the simple but time effective steps - so you don't get any quick benefit; and at the same time you're still having to do the task manually. You're refusing to use your coffee machine until the 20 tonne bean hopper, with integrated roaster is finished.</p><p>Maybe I should change: 'Never knowingly under or over mechanised'.</p>"
  ]
}
